---
kind: type
id: T:Autodesk.Revit.DB.Electrical.NeutralMode
source: html/e8890ec2-1c61-1ff3-e4f6-8ad3ce9a431c.htm
---
# Autodesk.Revit.DB.Electrical.NeutralMode

An enumerated type to list the neutral mode for wire type.

## Syntax (C#)
```csharp
public enum NeutralMode
```